In [12]:
import pandas as pd
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass

In [ ]:
#1

In [13]:
str_conn = 'mysql+pymysql://root:zamorano85@127.0.0.1:3306/sakila'

In [14]:
cursor = create_engine(str_conn)

In [ ]:
#2

In [16]:
import pandas as pd
df_sakila = pd.read_sql('select * from rental', cursor)
df_sakila.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [17]:
from sqlalchemy import text

In [18]:
def rental_month(cursor, month, year):
    query = text ( f"""
    SELECT * ,
        date_format(convert(sakila.rental.rental_date, DATE), '%m') as 'month',
        date_format(convert(sakila.rental.rental_date, DATE), '%Y') as 'year'
    FROM rental
    WHERE
        date_format(convert(sakila.rental.rental_date, DATE), '%m') = "{month}" and
        date_format(convert(sakila.rental.rental_date, DATE), '%Y') = "{year}" ;
""")
    rental_data = pd.read_sql(query, cursor)
    return rental_data

In [21]:
rental_datas =rental_month(cursor,"06","2005")
rental_datas.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53,06,2005
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53,06,2005
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53,06,2005
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53,06,2005
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53,06,2005

In [ ]:
#3

In [22]:
def rental_count_month(rental_data, month, year):
    rentals = rental_data.groupby("customer_id").size().reset_index(name=f"rentals_{month}_{year}")
    return rentals

In [23]:
rentals_month = rental_count_month(rental_datas, 5, 2005)
rentals_month.head()

   customer_id  rentals_5_2005
0            1               7
1            2               1
2            3               4
3            4               6
4            5               5

In [24]:
#4
rentals_month = rental_count_month(rental_datas, 6, 2005)
rentals_month2 = rental_count_month(rental_datas, 7, 2005)

rental_datas = rental_month(cursor, "06", "2005")
rental_datas2 = rental_month(cursor, "07", "2005")

def compare_rentals(data1, data2):
    merged = pd.merge(data1, data2, on = "customer_id", how = "outer")
    merged['difference'] = merged ['rentals_5_2005'] - merged ["rentals_7_2005"]
    return merged

rentals1 = rental_count_month(rental_datas, 5, 2005)
rentals2 = rental_count_month(rental_datas2, 7, 2005)
compare = compare_rentals(rentals1, rentals2)
compare.head()

   customer_id  rentals_5_2005  rentals_7_2005  difference
0            1             7.0              12        -5.0
1            2             1.0              14       -13.0
2            3             4.0              13        -9.0
3            4             6.0               5         1.0
4            5             5.0              16       -11.0